[
    {
        "heading": "Scope",
        "position": 1,
        "body": "This best practice defines terms used in IMF workflows.",
        "valid": true
    },
    {
        "heading": "Document Status",
        "position": 2,        
        "body": "This Draft Best Practice is published by the IMF User Group. As a draft, it may be updated, replaced or deemed obsolete by other documents at any time. This document should not be cited as anything other than work in progress. This work is © 2019 Hollywood Professional Association and licensed under the Creative Commons Attribution-NoDerivatives 4.0 International License.",
        "valid": true
    },
    {
        "heading": "Background",
        "position": 3,          
        "body": "The current nomenclature pertinent to the packaging and delivery requirements of the Interoperable Master Format can lead to misinterpretation, confusion and present a number of challenges for service vendors and content owners who facilitate the mastering and version control of Composition Playlist instances and their respective assets. The recommendations outlined in this document are intended to mitigate such confusion and act as an industry reference for the version control and business-to-business interchange of IMF packages and delivery of their contained and/or newly created Composition Playlist instances.",
        "valid": true
    },
    {
        "heading": "Definitions",
        "position": 4,          
        "body": "Below are some of the most commonly used terms and agreed upon definitions currently in use. There may be slight variances for day to day usage, but this list is provided to reduce confusion across multiple varying workflow creators and users.",
        "valid": true
    },
    {
        "heading": "Anti-Definitions",
        "position": 5,          
        "body": "The following are definitions of existing terms in use by the industry that should not be adopted by IMF users e.g. the use of certain Digital Cinema terms, such as Original Version (OV). These terms have multiple interpretations depending upon the context and business entity and, as such, do not necessarily fit well within the IMF ecosystem.",
        "valid": true
    }
]